<a href="https://colab.research.google.com/github/Revanth-123456/hackathon/blob/main/Untitled2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
pip install pandas sqlalchemy

Requirement already satisfied: pandas in /usr/local/lib/python3.12/dist-packages (2.2.2)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.12/dist-packages (2.0.46)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.3)
Requirement already satisfied: greenlet>=1 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy) (3.3.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy) (4.15.0)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.12/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [11]:
pip install sqlite3

ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)
ERROR: No matching distribution found for sqlite3

In [12]:
import pandas as pd

# Load CSV file
orders_df = pd.read_csv("orders.csv")

# Check data
print(orders_df.head())
print(orders_df.info())

   order_id  user_id  restaurant_id  order_date  total_amount  \
0         1     2508            450  18-02-2023        842.97
1         2     2693            309  18-01-2023        546.68
2         3     2084            107  15-07-2023        163.93
3         4      319            224  04-10-2023       1155.97
4         5     1064            293  25-12-2023       1321.91

                  restaurant_name
0               New Foods Chinese
1  Ruchi Curry House Multicuisine
2           Spice Kitchen Punjabi
3          Darbar Kitchen Non-Veg
4       Royal Eatery South Indian
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10000 non-null  int64
 1   user_id          10000 non-null  int64
 2   restaurant_id    10000 non-null  int64
 3   order_date       10000 non-null  object
 4   total_amount     10000 non-null  float64
 5   restaurant_name  10000 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 468.9+ KB
None

In [13]:
# Load JSON file
users_df = pd.read_json("users.json")

# Check data
print(users_df.head())
print(users_df.info())

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     3000 non-null   int64
 1   name        3000 non-null   object
 2   city        3000 non-null   object
 3   membership  3000 non-null   object
dtypes: int64(1), object(3)
memory usage: 93.9+ KB
None

In [14]:
import sqlite3

# Create database connection
conn = sqlite3.connect("restaurants.db")
cursor = conn.cursor()

In [16]:
# Read SQL file
with open("restaurants.sql", "r") as file:
    sql_script = file.read()

# Execute SQL script
cursor.executescript(sql_script)

conn.commit()

OperationalError: table restaurants already exists

In [17]:
restaurants_df = pd.read_sql_query(
    "SELECT * FROM restaurants",
    conn
)

print(restaurants_df.head())
print(restaurants_df.info())

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   restaurant_id    500 non-null    int64
 1   restaurant_name  500 non-null    object
 2   cuisine          500 non-null    object
 3   rating           500 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 15.8+ KB
None

In [18]:
orders_users_df = pd.merge(
    orders_df,
    users_df,
    on="user_id",
    how="left"
)

print(orders_users_df.head())

   order_id  user_id  restaurant_id  order_date  total_amount  \
0         1     2508            450  18-02-2023        842.97
1         2     2693            309  18-01-2023        546.68
2         3     2084            107  15-07-2023        163.93
3         4      319            224  04-10-2023       1155.97
4         5     1064            293  25-12-2023       1321.91

                  restaurant_name       name       city membership
0               New Foods Chinese  User_2508  Hyderabad    Regular
1  Ruchi Curry House Multicuisine  User_2693       Pune    Regular
2           Spice Kitchen Punjabi  User_2084    Chennai       Gold
3          Darbar Kitchen Non-Veg   User_319  Bangalore       Gold
4       Royal Eatery South Indian  User_1064       Pune    Regular

In [19]:
final_df = pd.merge(
    orders_users_df,
    restaurants_df,
    on="restaurant_id",
    how="left"
)

print(final_df.head())

   order_id  user_id  restaurant_id  order_date  total_amount  \
0         1     2508            450  18-02-2023        842.97
1         2     2693            309  18-01-2023        546.68
2         3     2084            107  15-07-2023        163.93
3         4      319            224  04-10-2023       1155.97
4         5     1064            293  25-12-2023       1321.91

                restaurant_name_x       name       city membership  \
0               New Foods Chinese  User_2508  Hyderabad    Regular
1  Ruchi Curry House Multicuisine  User_2693       Pune    Regular
2           Spice Kitchen Punjabi  User_2084    Chennai       Gold
3          Darbar Kitchen Non-Veg   User_319  Bangalore       Gold
4       Royal Eatery South Indian  User_1064       Pune    Regular

  restaurant_name_y  cuisine  rating
0    Restaurant_450  Mexican     3.2
1    Restaurant_309   Indian     4.5
2    Restaurant_107  Mexican     4.0
3    Restaurant_224  Chinese     4.8
4    Restaurant_293  Italian     3.0

In [20]:
final_df.to_csv(
    "final_food_delivery_dataset.csv",
    index=False
)

print("Final dataset saved successfully!")

Final dataset saved successfully!

In [21]:
final_df.groupby("order_date")["order_id"].count()

order_date
01-01-2023    29
01-01-2024    27
01-02-2023    25
01-03-2023    37
01-04-2023    32
              ..
31-05-2023    33
31-07-2023    27
31-08-2023    24
31-10-2023    30
31-12-2023    29
Name: order_id, Length: 366, dtype: int64

In [22]:
final_df.groupby("membership")["order_id"].count()

membership
Gold       4987
Regular    5013
Name: order_id, dtype: int64

In [23]:
final_df.groupby("city")["total_amount"].sum()

city
Bangalore    2206946.58
Chennai      1990513.03
Hyderabad    1889366.58
Pune         1924797.93
Name: total_amount, dtype: float64

In [24]:
final_df.groupby("cuisine")["total_amount"].sum()

cuisine
Chinese    1930504.65
Indian     1971412.58
Italian    2024203.80
Mexican    2085503.09
Name: total_amount, dtype: float64

In [25]:
final_df.groupby("membership")["total_amount"].mean()

membership
Gold       797.145556
Regular    805.158434
Name: total_amount, dtype: float64

In [26]:
import pandas as pd

df = pd.read_csv("final_food_delivery_dataset.csv")

In [27]:
gold_city_revenue = (
    df[df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)

print(gold_city_revenue)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [28]:
avg_order_by_cuisine = (
    df.groupby("cuisine")["total_amount"]
    .mean()
    .sort_values(ascending=False)
)

print(avg_order_by_cuisine)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [29]:
user_total_spend = (
    df.groupby("user_id")["total_amount"]
    .sum()
)

count_users = user_total_spend[user_total_spend > 1000].count()
print(count_users)

2544

In [30]:
df["rating_range"] = pd.cut(
    df["rating"],
    bins=[3.0, 3.5, 4.0, 4.5, 5.0],
    labels=["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"]
)

rating_revenue = (
    df.groupby("rating_range")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)

print(rating_revenue)

rating_range
4.6–5.0    2197030.75
4.1–4.5    1960326.26
3.0–3.5    1881754.57
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

/tmp/ipython-input-3354052818.py:8: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("rating_range")["total_amount"]

In [31]:
gold_city_avg = (
    df[df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .mean()
    .sort_values(ascending=False)
)

print(gold_city_avg)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [32]:
restaurant_count = df.groupby("cuisine")["restaurant_id"].nunique()
revenue = df.groupby("cuisine")["total_amount"].sum()

summary = pd.concat([restaurant_count, revenue], axis=1)
summary.columns = ["restaurant_count", "total_revenue"]

print(summary.sort_values("restaurant_count"))

         restaurant_count  total_revenue
cuisine
Chinese               120     1930504.65
Indian                126     1971412.58
Italian               126     2024203.80
Mexican               128     2085503.09

In [33]:
gold_orders = df[df["membership"] == "Gold"].shape[0]
total_orders = df.shape[0]

percentage = round((gold_orders / total_orders) * 100)
print(percentage)

50

In [34]:
import pandas as pd
df = pd.read_csv("final_food_delivery_dataset.csv")
print(df.columns)

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

In [35]:
restaurant_stats = (
    final_df
    .groupby(["restaurant_id", "restaurant_name_x"])
    .agg(
        avg_order=("total_amount", "mean"),
        order_count=("total_amount", "count")
    )
)

filtered = restaurant_stats[restaurant_stats["order_count"] < 20]

result = filtered.sort_values("avg_order", ascending=False)

print(result.head(30))

                                                       avg_order  order_count
restaurant_id restaurant_name_x
294           Hotel Dhaba Multicuisine               1040.222308           13
262           Hotel Cafe Punjabi                     1029.473333           18
77            Sri Mess Punjabi                       1029.180833           12
193           Swagath Eatery Multicuisine            1026.306667           15
7             Ruchi Biryani Punjabi                  1002.140625           16
298           Swagath Foods Andhra                    989.822000           15
56            Sri Delights Pure Veg                   989.467222           18
135           Amma Eatery Non-Veg                     988.702222           18
343           Sai Cafe Andhra                         986.026471           17
312           Udupi Curry House Chinese               982.730000           14
160           Hotel Tiffins Pure Veg                  977.836000           15
380           Classic Kitchen Family Restaurant       973.167895           19
456           Hotel Dhaba Chinese                     973.125556           18
118           Amma Mess Pure Veg                      965.299444           18
158           Hotel Biryani Pure Veg                  964.577692           13
374           Annapurna Curry House Multicuisine      954.512353           17
189           Hotel Curry House Non-Veg               954.045714           14
360           Taste of Restaurant Family Restaurant   948.220000           10
323           Taste of Mess Chinese                   942.272778           18
179           Annapurna Foods Multicuisine            941.889444           18
248           Sri Kitchen Punjabi                     941.330625           16
98            Ruchi Dhaba Non-Veg                     940.719375           16
385           Ruchi Mess Multicuisine                 938.202778           18
325           Sri Cafe North Indian                   934.931667           18
365           Udupi Kitchen Multicuisine              927.130556           18
322           Sri Cafe Non-Veg                        924.932000           10
89            Amma Eatery Punjabi                     924.502500           16
191           Grand Mess North Indian                 924.427857           14
357           Grand Mess Punjabi                      918.806842           19
207           Grand Cafe Andhra                       918.166667           18

In [36]:
combo_revenue = (
    df.groupby(["membership", "cuisine"])["total_amount"]
    .sum()
    .sort_values(ascending=False)
)

print(combo_revenue)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [37]:
final_df["order_date"] = pd.to_datetime(final_df["order_date"])
final_df["quarter"] = final_df["order_date"].dt.to_period("Q")

quarter_revenue = (
    final_df
    .groupby("quarter")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)

print(quarter_revenue)

quarter
2023Q3    2037385.10
2023Q4    2018263.66
2023Q1    1993425.14
2023Q2    1945348.72
2024Q1      17201.50
Freq: Q-DEC, Name: total_amount, dtype: float64

/tmp/ipython-input-2376506777.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  final_df["order_date"] = pd.to_datetime(final_df["order_date"])

In [48]:
final_df[
    final_df["restaurant_name_y"] == "Restaurant_7"
][["restaurant_name_x", "restaurant_name_y"]].drop_duplicates()

       restaurant_name_x restaurant_name_y
8  Ruchi Biryani Punjabi      Restaurant_7

In [49]:
gold_orders_count = len(final_df[final_df["membership"] == "Gold"])
print("Total Gold member orders:", gold_orders_count)

Total Gold member orders: 4987

In [38]:
hyderabad_revenue = (
    final_df[final_df["city"] == "Hyderabad"]["total_amount"]
    .sum()
)

print("Hyderabad revenue:", round(hyderabad_revenue))

Hyderabad revenue: 1889367

In [39]:
distinct_users = final_df["user_id"].nunique()
print("Distinct users:", distinct_users)

Distinct users: 2883

In [40]:
gold_avg_order_value = (
    final_df[final_df["membership"] == "Gold"]["total_amount"]
    .mean()
)

print("Gold avg order value:", round(gold_avg_order_value, 2))

Gold avg order value: 797.15

In [41]:
high_rating_orders = len(final_df[final_df["rating"] >= 4.5])
print("Orders with rating ≥ 4.5:", high_rating_orders)

Orders with rating ≥ 4.5: 3374

In [42]:
gold_city_revenue = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)

print(gold_city_revenue)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [43]:
top_gold_city = gold_city_revenue.index[0]

orders_in_top_city = len(
    final_df[
        (final_df["membership"] == "Gold") &
        (final_df["city"] == top_gold_city)
    ]
)

print(f"Orders in top Gold city ({top_gold_city}):", orders_in_top_city)

Orders in top Gold city (Chennai): 1337